app/Helpers/Helper.php

    function setSetting(string $key, $value, $userId = null, $isPublic = true): void
    {
        $createdBy = $userId ?? creatorId();
        Setting::updateOrCreate(
            ['key' => $key, 'created_by' => $createdBy],
            ['value' => $value, 'is_public' => $isPublic]
        );
---
select * from `settings` where (`key` = 'logo_dark' and `created_by` = 1) limit 1

    function getAdminAllSetting($publicOnly = false)
    {
        $cacheKey = $publicOnly ? 'admin_settings_public' : 'admin_settings';
        $settings = Cache::rememberForever($cacheKey, function () use ($publicOnly) {
            $super_admin = User::where('type', 'superadmin')->first();
            if ($super_admin) {
                $query = Setting::where('created_by', $super_admin->id);
                if ($publicOnly) {
                    $query->where('is_public', 1);
                }
                return $query->pluck('value', 'key')->toArray();
---
select * from `users` where `type` = 'superadmin' limit 1
select `value`, `key` from `settings` where `created_by` = 1 and `is_public` = 1

    function getCompanyAllSetting($user_id = null, $publicOnly = false)
    {
        $user = $user_id ? User::find($user_id) : auth()->user();

        if (!$user) return [];

        if (!in_array($user->type, ['company', 'superadmin'])) {
            $user = User::find($user->created_by);
        }

        if ($user) {
            $key = $publicOnly ? 'company_settings_' . $user->id . '_public' : 'company_settings_' . $user->id;
            $settings = Cache::rememberForever($key, function () use ($user, $publicOnly) {
                $query = Setting::where('created_by', $user->id);
                if ($publicOnly) {
                    $query->where('is_public', 1);
                }
                return $query->pluck('value', 'key')->toArray();
---
select * from `users` where `users`.`id` = 1 limit 1
select `value`, `key` from `settings` where `created_by` = 1