app/Classes/Module.php

            function () use ($name) {
                if ($name === 'general') {
                    $this->name =  $name;
                    $this->alias =  $name;
                } else {
                    $this->addon = AddOn::where('module', $name)->orWhere('package_name', $name)->first();
---
select * from `add_ons` where `module` = 'AIAssistant' or `package_name` = 'AIAssistant' limit 1

    public function allEnabled(): array
    {

        return AddOn::where('is_enable', 1)->orderBy('priority')->pluck('module')->toArray() ?? [];
---
select `module` from `add_ons` where `is_enable` = 1 order by `priority` asc

    public function allEnabledAdmin(): array
    {
        return AddOn::where('for_admin', 1)->where('is_enable', 1)->orderBy('priority')->pluck('module')->toArray() ?? [];
---
select `module` from `add_ons` where `for_admin` = 1 and `is_enable` = 1 order by `priority` asc