app/Http/Controllers/HomeController.php

select MONTH(created_at) as month, COUNT(*) as count, SUM(price) as payments from `orders` where year(`created_at`) = 2026 group by `month` order by `month` asc
select sum(`price`) as aggregate from `orders`
select count(*) as aggregate from `orders`
select count(*) as aggregate from `plans`
select count(*) as aggregate from `users` where `type` = 'company'
---
    private function superAdminDashboard()
    {
        $orderData = Order::selectRaw('MONTH(created_at) as month, COUNT(*) as count, SUM(price) as payments')
            ->whereYear('created_at', now()->year)
            ->groupBy('month')
            ->orderBy('month')
            ->get()
            ->keyBy('month');

        $months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'];
        $chartData = [];
        for ($i = 1; $i <= 12; $i++) {
            $chartData[] = [
                'month' => $months[$i-1],
                'orders' => $orderData[$i]->count ?? 0,
                'payments' => $orderData[$i]->payments ?? 0
            ];
        }

        return Inertia::render('SuperAdminDashboard', [
            'stats' => [
                'order_payments' => Order::sum('price') ?? 0,
                'total_orders' => Order::count(),
                'total_plans' => Plan::count(),
                'total_companies' => User::where('type', 'company')->count(),