app/Http/Controllers/MediaController.php

    public function index()
    {
        if(Auth::user()->can('manage-media')){

            $user = auth()->user();
            $directoryId = request('directory_id');

            $mediaQuery = Media::query();

            // Filter by directory
            if ($directoryId) {
                $mediaQuery->where('directory_id', $directoryId);
            }
            // When no directory is selected, show all files (don't filter by directory_id)

            // Filter by user permissions
            if ($user->type === 'superadmin') {
                $mediaQuery->where('creator_id', creatorId());
            } elseif ($user->can('manage-any-media')) {
                // Company or user with manage-any-media can see own + team media
                $mediaQuery->where('created_by', creatorId());
            } elseif ($user->can('manage-own-media')) {
                // Company or user with manage-own-media can see own media
                $mediaQuery->where('creator_id', $user->id);
            } else {
                // Default: only own media
                $mediaQuery->whereRaw('1 = 0');
            }

            $media = $mediaQuery->latest()->get()->map(function ($media) {
                try {
                    $url = getImageUrlPrefix().'/'.$media->file_name;
                    return [
                        'id' => $media->id,
                        'name' => $media->name,
                        'file_name' => $media->file_name,
                        'url' => $url,
                        'thumb_url' => $url,
                        'size' => $media->size,
                        'mime_type' => $media->mime_type,
                        'creator_id' => $media->creator_id,
                        'created_by' => $media->created_by,
                        'created_at' => $media->created_at,
                    ];
                } catch (\Exception $e) {
                    return null;
                }
            })->filter();
---
select * from `media` where `creator_id` = 1 order by `created_at` desc

                    $media->uuid = \Str::uuid();

                    $media->creator_id = auth()->id();
                    $media->created_by = creatorId();
---
insert into `media` (`model_type`, `model_id`, `collection_name`, `name`, `file_name`, `mime_type`, `disk`, `size`, `manipulations`, `custom_properties`, `generated_conversions`, `responsive_images`, `uuid`, `creator_id`, `created_by`, `order_column`, `updated_at`, `created_at`) values ('App\\Models\\User', 1, 'files', 'kyro_dark', 'Iof99Wt4nd2HLJDIkDAuqfOnWr3eMtbLgv34bT8N.png', 'image/png', 'public', 19173, '[]', '[]', '[]', '[]', '143c5ea9-d4b4-411e-9700-7321c44eee4e', 1, 1, 6, '2026-03-03 07:03:42', '2026-03-03 07:03:42')

    public function destroy($id)
    {
        if(Auth::user()->can('delete-media')){
            $user = auth()->user();
            $query = Media::where('id', $id);

            // Permission-based media access
            if ($user->type === 'superadmin') {
                $query->where('creator_id', $user->id);
            } elseif ($user->can('manage-any-media')) {
                // Company or user with manage-any-media can see own + team media
                $query->where('created_by', creatorId());
            } elseif ($user->can('manage-own-media')) {
                // Company or user with manage-own-media can see own media
                $query->where('creator_id', $user->id);
            } else {
                // Default: only own media
                $query->whereRaw('1 = 0');
            }

            $media = $query->firstOrFail();
            $fileSize = $media->size;

            try {
                // Delete file from storage
                $filePath = $this->resolveMediaStoragePath($media);
                if ($filePath) {
                    Storage::disk($media->disk)->delete($filePath);
---
select * from `media` where `id` = '42' and `creator_id` = 1 limit 1
delete from `media` where `id` = 42