app/Http/Controllers/TranslationController.php

select `name` from `add_ons` where `is_enable` = 1
---
    public function getTranslations($locale)
    {
        if (!in_array($locale, self::ALLOWED_LANGUAGES)) {
            $locale = 'en';
        }

        $path = resource_path("lang/{$locale}.json");

        if (!File::exists($path)) {
            $path = resource_path("lang/en.json");
            $locale = 'en';
        }

        $layoutDirection = in_array($locale, ['ar', 'he']) ? 'rtl' : 'ltr';

        $translations = json_decode(File::get($path), true) ?? [];

        // Merge enabled package translations
        $enabledPackages = AddOn::where('is_enable', true)->pluck('name');